010_mix_heap/pgbench_write_2022-05-24T08:29:24.302178798.log
progress: 10.0 s, 33414.9 tps, lat 1.462 ms stddev 1.230
progress: 20.0 s, 21682.2 tps, lat 2.268 ms stddev 1.474
progress: 30.0 s, 22034.5 tps, lat 2.234 ms stddev 1.449
progress: 40.0 s, 21504.5 tps, lat 2.290 ms stddev 2.787
progress: 50.0 s, 22294.5 tps, lat 2.209 ms stddev 1.642
progress: 60.0 s, 22302.6 tps, lat 2.208 ms stddev 1.599
progress: 70.0 s, 20691.1 tps, lat 2.381 ms stddev 4.273
progress: 80.0 s, 22333.1 tps, lat 2.205 ms stddev 1.633
progress: 90.0 s, 21973.4 tps, lat 2.240 ms stddev 1.677
progress: 100.0 s, 20922.8 tps, lat 2.354 ms stddev 4.192
progress: 110.0 s, 22298.0 tps, lat 2.209 ms stddev 1.684
progress: 120.0 s, 22081.9 tps, lat 2.228 ms stddev 1.724
progress: 130.0 s, 20937.2 tps, lat 2.352 ms stddev 4.226
progress: 140.0 s, 22196.7 tps, lat 2.217 ms stddev 1.656
progress: 150.0 s, 21887.9 tps, lat 2.249 ms stddev 1.718
progress: 160.0 s, 20624.5 tps, lat 2.386 ms stddev 4.161
progress: 170.0 s, 22149.5 tps, lat 2.220 ms stddev 1.658
progress: 180.0 s, 22098.8 tps, lat 2.223 ms stddev 1.724
progress: 190.0 s, 20915.9 tps, lat 2.354 ms stddev 3.961
progress: 200.0 s, 22147.7 tps, lat 2.221 ms stddev 1.630
progress: 210.0 s, 21807.2 tps, lat 2.253 ms stddev 1.729
progress: 220.0 s, 20758.8 tps, lat 2.367 ms stddev 4.017
progress: 230.0 s, 22084.7 tps, lat 2.225 ms stddev 1.668
progress: 240.0 s, 21952.1 tps, lat 2.236 ms stddev 1.687
progress: 250.0 s, 21408.8 tps, lat 2.294 ms stddev 2.730
progress: 260.0 s, 20754.9 tps, lat 2.359 ms stddev 3.114
progress: 270.0 s, 21337.3 tps, lat 2.294 ms stddev 1.755
progress: 280.0 s, 21044.4 tps, lat 2.330 ms stddev 2.796
progress: 290.0 s, 20988.8 tps, lat 2.336 ms stddev 3.136
progress: 300.0 s, 21842.2 tps, lat 2.244 ms stddev 1.745
progress: 310.0 s, 21159.0 tps, lat 2.320 ms stddev 2.980
progress: 320.0 s, 21341.5 tps, lat 2.297 ms stddev 2.632
progress: 330.0 s, 21066.0 tps, lat 2.325 ms stddev 2.438
progress: 340.0 s, 21153.0 tps, lat 2.318 ms stddev 2.684
progress: 350.0 s, 21612.1 tps, lat 2.267 ms stddev 1.706
progress: 360.0 s, 21127.6 tps, lat 2.318 ms stddev 2.527
progress: 370.0 s, 20994.5 tps, lat 2.339 ms stddev 3.105
progress: 380.0 s, 21801.2 tps, lat 2.254 ms stddev 1.704
progress: 390.0 s, 21180.5 tps, lat 2.321 ms stddev 2.409
progress: 400.0 s, 20904.8 tps, lat 2.354 ms stddev 3.238
progress: 410.0 s, 21546.1 tps, lat 2.281 ms stddev 1.708
progress: 420.0 s, 21809.5 tps, lat 2.255 ms stddev 2.024
progress: 430.0 s, 21251.1 tps, lat 2.316 ms stddev 3.626
progress: 440.0 s, 21814.0 tps, lat 2.255 ms stddev 1.736
progress: 450.0 s, 21684.6 tps, lat 2.268 ms stddev 2.053
progress: 460.0 s, 20919.6 tps, lat 2.351 ms stddev 3.373
progress: 470.0 s, 22084.4 tps, lat 2.228 ms stddev 1.639
progress: 480.0 s, 21790.8 tps, lat 2.259 ms stddev 2.055
progress: 490.0 s, 21085.3 tps, lat 2.334 ms stddev 3.420
progress: 500.0 s, 21830.5 tps, lat 2.254 ms stddev 1.662
progress: 510.0 s, 21615.6 tps, lat 2.277 ms stddev 1.712
progress: 520.0 s, 20654.9 tps, lat 2.383 ms stddev 3.894
progress: 530.0 s, 21887.4 tps, lat 2.248 ms stddev 1.650
progress: 540.0 s, 21915.9 tps, lat 2.246 ms stddev 1.790
progress: 550.0 s, 20771.1 tps, lat 2.369 ms stddev 3.736
progress: 560.0 s, 21889.0 tps, lat 2.247 ms stddev 1.664
progress: 570.0 s, 21560.3 tps, lat 2.279 ms stddev 1.728
progress: 580.0 s, 20282.2 tps, lat 2.425 ms stddev 3.876
progress: 590.0 s, 21776.4 tps, lat 2.257 ms stddev 1.745
progress: 600.0 s, 21527.4 tps, lat 2.282 ms stddev 1.833
progress: 610.0 s, 21446.8 tps, lat 2.287 ms stddev 1.763
progress: 620.0 s, 20582.3 tps, lat 2.390 ms stddev 3.746
progress: 630.0 s, 21543.1 tps, lat 2.278 ms stddev 1.685
progress: 640.0 s, 21296.9 tps, lat 2.303 ms stddev 1.747
progress: 650.0 s, 20472.5 tps, lat 2.397 ms stddev 3.679
progress: 660.0 s, 21558.0 tps, lat 2.277 ms stddev 1.695
progress: 670.0 s, 21320.5 tps, lat 2.299 ms stddev 1.805
progress: 680.0 s, 20957.9 tps, lat 2.338 ms stddev 2.704
progress: 690.0 s, 20858.0 tps, lat 2.354 ms stddev 4.208
progress: 700.0 s, 21330.9 tps, lat 2.309 ms stddev 2.373
progress: 710.0 s, 21546.1 tps, lat 2.286 ms stddev 2.635
progress: 720.0 s, 21594.9 tps, lat 2.277 ms stddev 2.069
progress: 730.0 s, 21217.2 tps, lat 2.316 ms stddev 2.389
progress: 740.0 s, 21046.4 tps, lat 2.333 ms stddev 2.612
progress: 750.0 s, 21266.2 tps, lat 2.311 ms stddev 2.274
progress: 760.0 s, 21186.7 tps, lat 2.319 ms stddev 2.609
progress: 770.0 s, 21068.1 tps, lat 2.329 ms stddev 2.537
progress: 780.0 s, 21033.9 tps, lat 2.331 ms stddev 2.073
progress: 790.0 s, 17920.3 tps, lat 2.730 ms stddev 4.417
progress: 800.0 s, 14906.5 tps, lat 3.274 ms stddev 10.492
progress: 810.0 s, 18165.4 tps, lat 2.695 ms stddev 8.575
progress: 820.0 s, 19793.8 tps, lat 2.479 ms stddev 2.895
progress: 830.0 s, 19235.4 tps, lat 2.559 ms stddev 8.603
progress: 840.0 s, 20798.4 tps, lat 2.367 ms stddev 5.400
progress: 850.0 s, 21204.2 tps, lat 2.317 ms stddev 1.756
progress: 860.0 s, 18928.7 tps, lat 2.594 ms stddev 8.009
progress: 870.0 s, 20006.8 tps, lat 2.423 ms stddev 3.534
progress: 880.0 s, 20655.0 tps, lat 2.403 ms stddev 3.594
progress: 890.0 s, 18965.0 tps, lat 2.587 ms stddev 8.256
progress: 900.0 s, 20300.1 tps, lat 2.409 ms stddev 2.487
progress: 910.0 s, 20277.4 tps, lat 2.420 ms stddev 5.026
progress: 920.0 s, 20453.3 tps, lat 2.404 ms stddev 5.430
progress: 930.0 s, 20284.1 tps, lat 2.424 ms stddev 5.889
progress: 940.0 s, 20219.5 tps, lat 2.426 ms stddev 5.240
progress: 950.0 s, 20282.4 tps, lat 2.418 ms stddev 5.357
progress: 960.0 s, 20022.0 tps, lat 2.456 ms stddev 7.051
progress: 970.0 s, 20244.3 tps, lat 2.429 ms stddev 5.342
progress: 980.0 s, 20308.1 tps, lat 2.418 ms stddev 4.992
progress: 990.0 s, 20127.7 tps, lat 2.440 ms stddev 5.641
progress: 1000.0 s, 20132.0 tps, lat 2.431 ms stddev 4.375
progress: 1010.0 s, 20244.3 tps, lat 2.432 ms stddev 6.727
progress: 1020.0 s, 19929.7 tps, lat 2.473 ms stddev 7.891
progress: 1030.0 s, 20836.2 tps, lat 2.359 ms stddev 2.630
progress: 1040.0 s, 19697.9 tps, lat 2.498 ms stddev 7.432
progress: 1050.0 s, 21222.8 tps, lat 2.319 ms stddev 1.875
progress: 1060.0 s, 19768.7 tps, lat 2.489 ms stddev 7.321
progress: 1070.0 s, 20937.1 tps, lat 2.351 ms stddev 4.677
progress: 1080.0 s, 19699.4 tps, lat 2.492 ms stddev 10.072
progress: 1090.0 s, 19888.0 tps, lat 2.476 ms stddev 7.049
progress: 1100.0 s, 20836.2 tps, lat 2.361 ms stddev 3.401
progress: 1110.0 s, 20210.6 tps, lat 2.430 ms stddev 5.665
progress: 1120.0 s, 20654.8 tps, lat 2.373 ms stddev 2.883
progress: 1130.0 s, 19330.4 tps, lat 2.546 ms stddev 8.226
progress: 1140.0 s, 20329.0 tps, lat 2.423 ms stddev 6.883
progress: 1150.0 s, 21310.9 tps, lat 2.310 ms stddev 2.748
progress: 1160.0 s, 21014.2 tps, lat 2.344 ms stddev 4.540
progress: 1170.0 s, 19208.3 tps, lat 2.557 ms stddev 7.183
progress: 1180.0 s, 20887.0 tps, lat 2.349 ms stddev 1.487
progress: 1190.0 s, 21212.1 tps, lat 2.314 ms stddev 1.453
progress: 1200.0 s, 21065.4 tps, lat 2.333 ms stddev 1.545
progress: 1210.0 s, 21034.2 tps, lat 2.331 ms stddev 1.451
progress: 1220.0 s, 20863.7 tps, lat 2.348 ms stddev 1.527
progress: 1230.0 s, 21569.7 tps, lat 2.279 ms stddev 1.361
progress: 1240.0 s, 21152.0 tps, lat 2.320 ms stddev 1.424
progress: 1250.0 s, 21023.6 tps, lat 2.330 ms stddev 1.510
progress: 1260.0 s, 21322.4 tps, lat 2.301 ms stddev 1.378
progress: 1270.0 s, 20904.8 tps, lat 2.348 ms stddev 1.489
progress: 1280.0 s, 21500.5 tps, lat 2.285 ms stddev 1.430
progress: 1290.0 s, 21022.0 tps, lat 2.333 ms stddev 1.458
progress: 1300.0 s, 21208.2 tps, lat 2.314 ms stddev 1.409
progress: 1310.0 s, 21444.0 tps, lat 2.289 ms stddev 1.435
progress: 1320.0 s, 21619.6 tps, lat 2.273 ms stddev 1.359
progress: 1330.0 s, 21026.2 tps, lat 2.334 ms stddev 1.517
progress: 1340.0 s, 21042.5 tps, lat 2.332 ms stddev 1.450
progress: 1350.0 s, 21369.8 tps, lat 2.297 ms stddev 1.440
progress: 1360.0 s, 21249.2 tps, lat 2.312 ms stddev 1.411
progress: 1370.0 s, 21330.2 tps, lat 2.305 ms stddev 1.439
progress: 1380.0 s, 21529.7 tps, lat 2.283 ms stddev 1.419
progress: 1390.0 s, 21296.1 tps, lat 2.310 ms stddev 1.457
progress: 1400.0 s, 21389.5 tps, lat 2.297 ms stddev 1.378
progress: 1410.0 s, 21098.7 tps, lat 2.328 ms stddev 1.440
progress: 1420.0 s, 20980.1 tps, lat 2.339 ms stddev 1.430
progress: 1430.0 s, 21261.0 tps, lat 2.313 ms stddev 1.529
progress: 1440.0 s, 21468.1 tps, lat 2.290 ms stddev 1.434
progress: 1450.0 s, 21328.6 tps, lat 2.304 ms stddev 1.426
progress: 1460.0 s, 21360.9 tps, lat 2.300 ms stddev 1.379
progress: 1470.0 s, 11711.1 tps, lat 4.203 ms stddev 18.085
progress: 1480.0 s, 1221.2 tps, lat 40.809 ms stddev 57.405
progress: 1490.0 s, 18548.2 tps, lat 2.676 ms stddev 8.714
progress: 1500.0 s, 22286.9 tps, lat 2.210 ms stddev 0.740
progress: 1510.0 s, 22185.6 tps, lat 2.220 ms stddev 0.736
progress: 1520.0 s, 22135.6 tps, lat 2.225 ms stddev 0.744
progress: 1530.0 s, 21931.3 tps, lat 2.244 ms stddev 0.800
progress: 1540.0 s, 22125.0 tps, lat 2.225 ms stddev 0.749
progress: 1550.0 s, 22208.6 tps, lat 2.216 ms stddev 0.735
progress: 1560.0 s, 21693.6 tps, lat 2.270 ms stddev 0.756
progress: 1570.0 s, 20765.7 tps, lat 2.373 ms stddev 0.765
progress: 1580.0 s, 21386.8 tps, lat 2.300 ms stddev 0.784
progress: 1590.0 s, 22242.9 tps, lat 2.215 ms stddev 0.675
progress: 1600.0 s, 22047.3 tps, lat 2.234 ms stddev 0.724
progress: 1610.0 s, 22307.7 tps, lat 2.210 ms stddev 0.704
progress: 1620.0 s, 22326.9 tps, lat 2.206 ms stddev 0.708
progress: 1630.0 s, 21978.0 tps, lat 2.239 ms stddev 0.748
progress: 1640.0 s, 22078.4 tps, lat 2.230 ms stddev 0.746
progress: 1650.0 s, 22001.7 tps, lat 2.237 ms stddev 0.764
progress: 1660.0 s, 22089.9 tps, lat 2.229 ms stddev 0.729
progress: 1670.0 s, 22100.7 tps, lat 2.229 ms stddev 0.752
progress: 1680.0 s, 22249.6 tps, lat 2.213 ms stddev 0.717
progress: 1690.0 s, 22071.7 tps, lat 2.231 ms stddev 0.741
progress: 1700.0 s, 21804.3 tps, lat 2.258 ms stddev 0.793
progress: 1710.0 s, 21906.4 tps, lat 2.247 ms stddev 0.768
progress: 1720.0 s, 21566.8 tps, lat 2.280 ms stddev 0.825
progress: 1730.0 s, 21832.3 tps, lat 2.258 ms stddev 0.767
progress: 1740.0 s, 22241.3 tps, lat 2.216 ms stddev 0.700
progress: 1750.0 s, 21937.4 tps, lat 2.246 ms stddev 0.791
progress: 1760.0 s, 22024.2 tps, lat 2.238 ms stddev 0.781
progress: 1770.0 s, 21698.7 tps, lat 2.266 ms stddev 0.769
progress: 1780.0 s, 21816.4 tps, lat 2.255 ms stddev 0.792
progress: 1790.0 s, 22261.6 tps, lat 2.213 ms stddev 0.720
progress: 1800.0 s, 22101.2 tps, lat 2.227 ms stddev 0.751
progress: 1810.0 s, 22028.7 tps, lat 2.236 ms stddev 0.776
progress: 1820.0 s, 22021.9 tps, lat 2.238 ms stddev 0.755
progress: 1830.0 s, 22028.9 tps, lat 2.237 ms stddev 0.782
progress: 1840.0 s, 22058.8 tps, lat 2.234 ms stddev 0.735
progress: 1850.0 s, 22045.3 tps, lat 2.235 ms stddev 0.820
progress: 1860.0 s, 22192.8 tps, lat 2.222 ms stddev 0.734
progress: 1870.0 s, 22251.7 tps, lat 2.215 ms stddev 0.716
progress: 1880.0 s, 22035.8 tps, lat 2.237 ms stddev 0.800
progress: 1890.0 s, 22036.1 tps, lat 2.236 ms stddev 0.764
progress: 1900.0 s, 21982.9 tps, lat 2.241 ms stddev 0.814
progress: 1910.0 s, 21885.4 tps, lat 2.252 ms stddev 0.858
progress: 1920.0 s, 21889.5 tps, lat 2.251 ms stddev 0.840
progress: 1930.0 s, 21880.5 tps, lat 2.251 ms stddev 0.832
progress: 1940.0 s, 21891.9 tps, lat 2.249 ms stddev 0.861
progress: 1950.0 s, 22195.4 tps, lat 2.221 ms stddev 0.733
progress: 1960.0 s, 22139.2 tps, lat 2.227 ms stddev 0.747
progress: 1970.0 s, 22094.9 tps, lat 2.231 ms stddev 0.764
progress: 1980.0 s, 22132.9 tps, lat 2.228 ms stddev 0.780
progress: 1990.0 s, 22087.7 tps, lat 2.231 ms stddev 0.740
progress: 2000.0 s, 22090.9 tps, lat 2.232 ms stddev 0.756
progress: 2010.0 s, 21778.1 tps, lat 2.259 ms stddev 0.822
progress: 2020.0 s, 21943.1 tps, lat 2.246 ms stddev 0.773
progress: 2030.0 s, 21901.0 tps, lat 2.247 ms stddev 0.812
progress: 2040.0 s, 21822.1 tps, lat 2.256 ms stddev 0.821
progress: 2050.0 s, 22045.0 tps, lat 2.235 ms stddev 0.741
progress: 2060.0 s, 21791.0 tps, lat 2.260 ms stddev 0.840
progress: 2070.0 s, 21476.5 tps, lat 2.290 ms stddev 0.946
progress: 2080.0 s, 21842.6 tps, lat 2.256 ms stddev 0.816
progress: 2090.0 s, 21881.5 tps, lat 2.249 ms stddev 0.827
progress: 2100.0 s, 21919.4 tps, lat 2.247 ms stddev 0.828
progress: 2110.0 s, 21803.7 tps, lat 2.260 ms stddev 0.826
progress: 2120.0 s, 22212.8 tps, lat 2.218 ms stddev 0.765
progress: 2130.0 s, 21444.9 tps, lat 2.295 ms stddev 0.887
progress: 2140.0 s, 21958.0 tps, lat 2.244 ms stddev 0.770
progress: 2150.0 s, 12494.0 tps, lat 3.845 ms stddev 24.797
progress: 2160.0 s, 1362.4 tps, lat 37.377 ms stddev 57.839
progress: 2170.0 s, 13019.4 tps, lat 3.848 ms stddev 16.689
progress: 2180.0 s, 21989.0 tps, lat 2.241 ms stddev 0.737
progress: 2190.0 s, 21714.8 tps, lat 2.268 ms stddev 0.784
progress: 2200.0 s, 21891.2 tps, lat 2.249 ms stddev 0.749
progress: 2210.0 s, 21979.1 tps, lat 2.242 ms stddev 0.765
progress: 2220.0 s, 22172.3 tps, lat 2.224 ms stddev 0.771
progress: 2230.0 s, 21867.9 tps, lat 2.253 ms stddev 0.795
progress: 2240.0 s, 21964.1 tps, lat 2.244 ms stddev 0.775
progress: 2250.0 s, 17385.9 tps, lat 2.817 ms stddev 1.245
progress: 2260.0 s, 19251.9 tps, lat 2.557 ms stddev 6.822
progress: 2270.0 s, 21415.4 tps, lat 2.296 ms stddev 0.771
progress: 2280.0 s, 21832.7 tps, lat 2.256 ms stddev 0.743
progress: 2290.0 s, 21711.6 tps, lat 2.269 ms stddev 0.789
progress: 2300.0 s, 21873.1 tps, lat 2.253 ms stddev 0.759
progress: 2310.0 s, 21851.5 tps, lat 2.252 ms stddev 0.799
progress: 2320.0 s, 21522.2 tps, lat 2.289 ms stddev 0.846
progress: 2330.0 s, 21911.8 tps, lat 2.247 ms stddev 0.789
progress: 2340.0 s, 22152.4 tps, lat 2.224 ms stddev 0.732
progress: 2350.0 s, 22003.9 tps, lat 2.239 ms stddev 0.782
progress: 2360.0 s, 22035.3 tps, lat 2.237 ms stddev 0.761
progress: 2370.0 s, 22081.6 tps, lat 2.229 ms stddev 0.772
progress: 2380.0 s, 22020.4 tps, lat 2.238 ms stddev 0.741
progress: 2390.0 s, 21778.0 tps, lat 2.259 ms stddev 0.805
progress: 2400.0 s, 22032.8 tps, lat 2.235 ms stddev 0.741
progress: 2410.0 s, 22116.1 tps, lat 2.228 ms stddev 0.703
progress: 2420.0 s, 21855.9 tps, lat 2.252 ms stddev 0.780
progress: 2430.0 s, 21803.0 tps, lat 2.257 ms stddev 0.783
progress: 2440.0 s, 21537.8 tps, lat 2.278 ms stddev 0.832
progress: 2450.0 s, 21977.4 tps, lat 2.241 ms stddev 0.777
progress: 2460.0 s, 21862.3 tps, lat 2.254 ms stddev 0.786
progress: 2470.0 s, 21698.5 tps, lat 2.269 ms stddev 0.835
progress: 2480.0 s, 21936.1 tps, lat 2.246 ms stddev 0.771
progress: 2490.0 s, 21958.2 tps, lat 2.245 ms stddev 0.788
progress: 2500.0 s, 21222.7 tps, lat 2.312 ms stddev 0.905
progress: 2510.0 s, 21907.1 tps, lat 2.244 ms stddev 0.790
progress: 2520.0 s, 22002.9 tps, lat 2.238 ms stddev 0.749
progress: 2530.0 s, 21365.8 tps, lat 2.300 ms stddev 0.863
progress: 2540.0 s, 21592.6 tps, lat 2.279 ms stddev 0.826
progress: 2550.0 s, 21793.4 tps, lat 2.259 ms stddev 0.789
progress: 2560.0 s, 21329.3 tps, lat 2.303 ms stddev 0.891
progress: 2570.0 s, 21579.5 tps, lat 2.282 ms stddev 0.821
progress: 2580.0 s, 22014.5 tps, lat 2.237 ms stddev 0.732
progress: 2590.0 s, 21590.1 tps, lat 2.279 ms stddev 0.859
progress: 2600.0 s, 21512.8 tps, lat 2.285 ms stddev 0.783
progress: 2610.0 s, 21923.2 tps, lat 2.246 ms stddev 0.781
progress: 2620.0 s, 21658.6 tps, lat 2.268 ms stddev 0.834
progress: 2630.0 s, 21682.2 tps, lat 2.269 ms stddev 0.797
progress: 2640.0 s, 21496.6 tps, lat 2.287 ms stddev 0.822
progress: 2650.0 s, 20949.8 tps, lat 2.344 ms stddev 0.876
progress: 2660.0 s, 20878.0 tps, lat 2.346 ms stddev 0.914
progress: 2670.0 s, 20454.4 tps, lat 2.388 ms stddev 0.925
progress: 2680.0 s, 20391.6 tps, lat 2.396 ms stddev 0.973
progress: 2690.0 s, 21824.2 tps, lat 2.257 ms stddev 0.785
progress: 2700.0 s, 21958.4 tps, lat 2.243 ms stddev 0.786
progress: 2710.0 s, 21624.7 tps, lat 2.278 ms stddev 0.883
progress: 2720.0 s, 21891.3 tps, lat 2.251 ms stddev 0.795
progress: 2730.0 s, 21253.1 tps, lat 2.314 ms stddev 0.873
progress: 2740.0 s, 21067.5 tps, lat 2.331 ms stddev 0.910
progress: 2750.0 s, 21746.6 tps, lat 2.265 ms stddev 0.799
progress: 2760.0 s, 21563.0 tps, lat 2.284 ms stddev 0.838
progress: 2770.0 s, 21241.4 tps, lat 2.317 ms stddev 0.909
progress: 2780.0 s, 21349.3 tps, lat 2.304 ms stddev 0.883
progress: 2790.0 s, 21780.6 tps, lat 2.259 ms stddev 0.789
progress: 2800.0 s, 14353.0 tps, lat 3.440 ms stddev 12.459
progress: 2810.0 s, 872.5 tps, lat 56.585 ms stddev 79.318
progress: 2820.0 s, 8177.1 tps, lat 6.155 ms stddev 24.598
progress: 2830.0 s, 21782.6 tps, lat 2.262 ms stddev 0.789
progress: 2840.0 s, 21781.4 tps, lat 2.262 ms stddev 0.785
progress: 2850.0 s, 21922.1 tps, lat 2.248 ms stddev 0.777
progress: 2860.0 s, 21915.9 tps, lat 2.248 ms stddev 0.759
progress: 2870.0 s, 21695.3 tps, lat 2.269 ms stddev 0.782
progress: 2880.0 s, 21640.5 tps, lat 2.275 ms stddev 0.823
progress: 2890.0 s, 21673.4 tps, lat 2.271 ms stddev 0.815
progress: 2900.0 s, 20263.9 tps, lat 2.427 ms stddev 0.847
progress: 2910.0 s, 20691.6 tps, lat 2.381 ms stddev 0.726
progress: 2920.0 s, 21374.0 tps, lat 2.307 ms stddev 0.728
progress: 2930.0 s, 20991.1 tps, lat 2.344 ms stddev 0.853
progress: 2940.0 s, 21328.1 tps, lat 2.307 ms stddev 0.822
progress: 2950.0 s, 21541.2 tps, lat 2.287 ms stddev 0.763
progress: 2960.0 s, 21705.5 tps, lat 2.270 ms stddev 0.796
progress: 2970.0 s, 21560.7 tps, lat 2.283 ms stddev 0.807
progress: 2980.0 s, 21768.2 tps, lat 2.263 ms stddev 0.767
progress: 2990.0 s, 21589.4 tps, lat 2.282 ms stddev 0.843
progress: 3000.0 s, 21903.8 tps, lat 2.248 ms stddev 0.789
progress: 3010.0 s, 21526.6 tps, lat 2.287 ms stddev 0.811
progress: 3020.0 s, 21430.7 tps, lat 2.297 ms stddev 0.868
progress: 3030.0 s, 21690.7 tps, lat 2.272 ms stddev 0.826
progress: 3040.0 s, 21465.7 tps, lat 2.295 ms stddev 0.835
progress: 3050.0 s, 21612.8 tps, lat 2.278 ms stddev 0.834
progress: 3060.0 s, 21730.6 tps, lat 2.268 ms stddev 0.800
progress: 3070.0 s, 21546.0 tps, lat 2.286 ms stddev 0.847
progress: 3080.0 s, 21732.7 tps, lat 2.268 ms stddev 0.818
progress: 3090.0 s, 21269.7 tps, lat 2.314 ms stddev 0.900
progress: 3100.0 s, 21452.8 tps, lat 2.297 ms stddev 0.829
progress: 3110.0 s, 21685.9 tps, lat 2.271 ms stddev 0.785
progress: 3120.0 s, 21440.3 tps, lat 2.298 ms stddev 0.878
progress: 3130.0 s, 21435.7 tps, lat 2.298 ms stddev 0.857
progress: 3140.0 s, 21337.6 tps, lat 2.308 ms stddev 0.860
progress: 3150.0 s, 21545.3 tps, lat 2.287 ms stddev 0.843
progress: 3160.0 s, 21619.5 tps, lat 2.279 ms stddev 0.797
progress: 3170.0 s, 21406.1 tps, lat 2.303 ms stddev 0.862
progress: 3180.0 s, 21315.4 tps, lat 2.309 ms stddev 0.878
progress: 3190.0 s, 21366.5 tps, lat 2.302 ms stddev 0.849
progress: 3200.0 s, 21422.9 tps, lat 2.298 ms stddev 0.878
progress: 3210.0 s, 21501.5 tps, lat 2.290 ms stddev 0.841
progress: 3220.0 s, 21167.3 tps, lat 2.322 ms stddev 0.904
progress: 3230.0 s, 21395.3 tps, lat 2.299 ms stddev 0.846
progress: 3240.0 s, 21592.8 tps, lat 2.282 ms stddev 0.818
progress: 3250.0 s, 20883.3 tps, lat 2.349 ms stddev 0.963
progress: 3260.0 s, 21097.1 tps, lat 2.331 ms stddev 0.899
progress: 3270.0 s, 21469.3 tps, lat 2.293 ms stddev 0.841
progress: 3280.0 s, 20653.6 tps, lat 2.376 ms stddev 0.938
progress: 3290.0 s, 21102.1 tps, lat 2.330 ms stddev 0.893
progress: 3300.0 s, 21437.4 tps, lat 2.297 ms stddev 0.847
progress: 3310.0 s, 21088.6 tps, lat 2.330 ms stddev 0.903
progress: 3320.0 s, 21444.9 tps, lat 2.297 ms stddev 0.842
progress: 3330.0 s, 21446.1 tps, lat 2.296 ms stddev 0.840
progress: 3340.0 s, 21290.6 tps, lat 2.310 ms stddev 0.865
progress: 3350.0 s, 21316.7 tps, lat 2.309 ms stddev 0.898
progress: 3360.0 s, 21281.3 tps, lat 2.311 ms stddev 0.896
progress: 3370.0 s, 21123.4 tps, lat 2.329 ms stddev 0.873
progress: 3380.0 s, 20423.3 tps, lat 2.394 ms stddev 0.991
progress: 3390.0 s, 21479.9 tps, lat 2.293 ms stddev 0.821
progress: 3400.0 s, 21027.4 tps, lat 2.338 ms stddev 0.899
progress: 3410.0 s, 20731.0 tps, lat 2.369 ms stddev 0.959
progress: 3420.0 s, 21405.2 tps, lat 2.299 ms stddev 0.879
progress: 3430.0 s, 5131.0 tps, lat 9.323 ms stddev 33.027
progress: 3440.0 s, 466.8 tps, lat 111.070 ms stddev 153.866
progress: 3450.0 s, 1108.3 tps, lat 45.094 ms stddev 47.165
progress: 3460.0 s, 21305.9 tps, lat 2.308 ms stddev 0.835
progress: 3470.0 s, 21609.8 tps, lat 2.279 ms stddev 0.787
progress: 3480.0 s, 21623.9 tps, lat 2.278 ms stddev 0.805
progress: 3490.0 s, 21041.0 tps, lat 2.335 ms stddev 0.874
progress: 3500.0 s, 21175.5 tps, lat 2.322 ms stddev 0.895
progress: 3510.0 s, 21276.0 tps, lat 2.310 ms stddev 0.852
progress: 3520.0 s, 21207.6 tps, lat 2.321 ms stddev 0.859
progress: 3530.0 s, 21311.0 tps, lat 2.309 ms stddev 0.843
progress: 3540.0 s, 17144.8 tps, lat 2.860 ms stddev 1.205
progress: 3550.0 s, 19869.8 tps, lat 2.469 ms stddev 0.918
progress: 3560.0 s, 20640.8 tps, lat 2.380 ms stddev 0.844
progress: 3570.0 s, 20676.2 tps, lat 2.374 ms stddev 0.890
progress: 3580.0 s, 21094.1 tps, lat 2.336 ms stddev 0.832
progress: 3590.0 s, 21331.5 tps, lat 2.309 ms stddev 0.802
progress: 3600.0 s, 21288.2 tps, lat 2.314 ms stddev 0.855
transaction type: pgbench_write_orioledb.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 5
duration: 3600 s
number of transactions actually processed: 75283531
latency average = 2.353 ms
latency stddev = 3.902 ms
tps = 20912.051124 (including connections establishing)
tps = 20912.081268 (excluding connections establishing)
statement latencies in milliseconds:
         0.001  \set region_id 0
         0.005  \set ns_id random_zipfian(1, 10, 1.1)
         0.002  \set emitter random_zipfian(1000, 3000, 1.1)
         0.001  \set root_player_id random(1, 100000*:scale)
         0.003  \set currency_id random_zipfian(1, 50, 1.1)
         0.000  \set amount random(1, 10000)
         0.183  BEGIN;
         0.382  INSERT INTO trx_pgbench_0
         0.346  INSERT INTO op_pgbench_0
         0.286  INSERT INTO balance_version_pgbench_0
         0.333  INSERT INTO balance_pgbench_0
         0.810  END;